In [11]:
import pandas as pd
import os
%xmode minimal

Exception reporting mode: Minimal

In [12]:
url = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv'
file = '../data/titanic_2_original.pickle' # Damit es local gespeichert wird

if os.path.exists(file):
    t = pd.read_pickle(file)
else:
    t = pd.read_csv(url)
    t.to_pickle(file)
t.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
676,677,0,3,"Sawyer, Mr. Frederick Charles",male,24.50,0,0,342826,8.0500,NaN,S
430,431,1,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.00,0,0,110564,26.5500,C52,S
362,363,0,3,"Barbara, Mrs. (Catherine David)",female,45.00,0,1,2691,14.4542,NaN,C
648,649,0,3,"Willey, Mr. Edward",male,NaN,0,0,S.O./P.P. 751,7.5500,NaN,S
380,381,1,1,"Bidois, Miss. Rosalie",female,42.00,0,0,PC 17757,227.5250,NaN,C
844,845,0,3,"Culumovic, Mr. Jeso",male,17.00,0,0,315090,8.6625,NaN,S
266,267,0,3,"Panula, Mr. Ernesti Arvid",male,16.00,4,1,3101295,39.6875,NaN,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
512,513,1,1,"McGough, Mr. James Robert",male,36.00,0,0,PC 17473,26.2875,E25,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

## 4.1

In [15]:
def alter_bins(alter):
    if pd.isna(alter): return 'kein Alter'
    if alter < 11: return 'child'
    if alter <18 and alter >= 12: return 'teenager'
    if alter < 66 and alter > 17: return 'adult'
    if alter > 65: return 'adult'

In [16]:
t['alter_bin'] = t['Age'].apply(alter_bins)

In [22]:
t.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,alter_bin
715,716,0,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19.0,0,0,348124,7.6500,F G73,S,adult
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,adult
547,548,1,2,"Padro y Manent, Mr. Julian",male,NaN,0,0,SC/PARIS 2146,13.8625,NaN,C,kein Alter
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.2500,NaN,S,teenager
761,762,0,3,"Nirva, Mr. Iisakki Antino Aijo",male,41.0,0,0,SOTON/O2 3101272,7.1250,NaN,S,adult

## 4.2

In [23]:
def alter_bins(alter,sex):
    if pd.isna(alter): return 'kein Alter'
    if alter < 11: return 'child'
    if alter <18 and alter >= 12: return 'teenager'
    if alter < 66 and alter > 17 and sex == 'female': return 'male'
    if alter < 66 and alter > 17 and sex == 'female': return 'male'
    if alter > 65: return 'adult'

In [44]:
def alter_bins(row):
    alter = row['Age']
    sex = row['Sex']

    if pd.isna(alter):
        return 'kein Alter'
    if alter < 11:
        return 'child'
    if 12 <= alter < 18:
        return 'teenager'
    if 18 <= alter < 66:
        return 'male' if sex == 'male' else 'female'  
    if alter >= 66:
        return 'adult'

# Anwenden der Funktion auf jede Zeile
t['alter_bin_sex'] = t.apply(alter_bins, axis=1)

In [42]:
t.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,alter_bin,alter_bin_sex
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S,adult,female
620,621,0,3,"Yasbeck, Mr. Antoni",male,27.0,1,0,2659,14.4542,NaN,C,adult,male
381,382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.0,0,2,2653,15.7417,NaN,C,child,child
332,333,0,1,"Graham, Mr. George Edward",male,38.0,0,1,PC 17582,153.4625,C91,S,adult,male
404,405,0,3,"Oreskovic, Miss. Marija",female,20.0,0,0,315096,8.6625,NaN,S,adult,female

## 4.3
<br>
Funktionen: <br>
In Quantile aufteilen : t['Quantil'], grenzen = pd.qcut(Spalte bsp t['Spalte'], q=Anzahl Quantile, labels=Liste mit labels, retbins=True)

In [51]:
quantile_labels = ['niedrig', 'normal', 'hoch', 'sehr hoch']
t['Quantil'], grenzen = pd.qcut(t['Fare'], q=4, labels=quantile_labels, retbins=True)

# Ergebnis anzeigen
print(grenzen)

[  0.       7.9104  14.4542  31.     512.3292]